app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0])
---
INSERT INTO "songs" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2018-07-27 01:21:05.452692"], ["updated_at", "2018-07-27 01:21:05.452692"]]